DATA = {
    'omlet': {
        'яйца, шт': 2,
        'молоко, л': 0.1,
        'соль, ч.л.': 0.5,
    },
    'pasta': {
        'макароны, г': 0.3,
        'сыр, г': 0.05,
    },
    'buter': {
        'хлеб, ломтик': 1,
        'колбаса, ломтик': 1,
        'сыр, ломтик': 1,
        'помидор, ломтик': 1,
    },
    'doshik': {
        'содержимое дошика, упак.': 2,
        'мазик, грамм': 50,
        'сосиска, штук': 0.5,
    }
}

counter = 2
for product in DATA.get('omlet').keys():
    print(product, '-', end=' ')
    print(DATA['omlet'].get(product) * counter)
